# Lesson 5: Merging, Joining & Combining Data

In real-world analysis, data is rarely stored in one table.
We use merges and joins to combine multiple DataFrames based on common keys.

In [1]:
import pandas as pd

customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4],
    'Name': ['Piyush', 'Sneha', 'Ravi', 'Amit'],
    'City': ['Bhopal', 'Delhi', 'Pune', 'Mumbai']
})

orders = pd.DataFrame({
    'OrderID': [101, 102, 103, 104, 105],
    'CustomerID': [1, 2, 1, 4, 3],
    'Amount': [5000, 7000, 12000, 3000, 8500]
})

customers, orders

(   CustomerID    Name    City
 0           1  Piyush  Bhopal
 1           2   Sneha   Delhi
 2           3    Ravi    Pune
 3           4    Amit  Mumbai,
    OrderID  CustomerID  Amount
 0      101           1    5000
 1      102           2    7000
 2      103           1   12000
 3      104           4    3000
 4      105           3    8500)

1. Inner Join (Only common rows)

In [3]:
pd.merge(customers,orders,on='CustomerID', how='inner')

   CustomerID    Name    City  OrderID  Amount
0           1  Piyush  Bhopal      101    5000
1           1  Piyush  Bhopal      103   12000
2           2   Sneha   Delhi      102    7000
3           3    Ravi    Pune      105    8500
4           4    Amit  Mumbai      104    3000

2. Left Join (Keep all customers)

In [4]:
pd.merge(customers, orders, on="CustomerID", how="left")

   CustomerID    Name    City  OrderID  Amount
0           1  Piyush  Bhopal      101    5000
1           1  Piyush  Bhopal      103   12000
2           2   Sneha   Delhi      102    7000
3           3    Ravi    Pune      105    8500
4           4    Amit  Mumbai      104    3000

3. Right Join (Keep all orders)

In [5]:
pd.merge(customers, orders, on='CustomerID', how='right')

   CustomerID    Name    City  OrderID  Amount
0           1  Piyush  Bhopal      101    5000
1           2   Sneha   Delhi      102    7000
2           1  Piyush  Bhopal      103   12000
3           4    Amit  Mumbai      104    3000
4           3    Ravi    Pune      105    8500

4. Outer Join (Keep everything)

In [6]:
pd.merge(customers, orders, on='CustomerID', how='outer')

   CustomerID    Name    City  OrderID  Amount
0           1  Piyush  Bhopal      101    5000
1           1  Piyush  Bhopal      103   12000
2           2   Sneha   Delhi      102    7000
3           3    Ravi    Pune      105    8500
4           4    Amit  Mumbai      104    3000

### Joining Logic Summary:
- inner → intersection
- left → keep left
- right → keep right
- outer → union

5. Joining on Different Column Names

In [7]:
people = pd.DataFrame({
    'ID': [1, 2, 3],
    'Age': [26, 25, 27]
})

pd.merge(customers, people, left_on='CustomerID', right_on='ID')

   CustomerID    Name    City  ID  Age
0           1  Piyush  Bhopal   1   26
1           2   Sneha   Delhi   2   25
2           3    Ravi    Pune   3   27

6. Concatenation (Stacking DataFrames)

Row-wise (add more rows)

In [8]:
df1 = customers.iloc[:2]
df2 = customers.iloc[2:]
pd.concat([df1, df2], axis=0)

   CustomerID    Name    City
0           1  Piyush  Bhopal
1           2   Sneha   Delhi
2           3    Ravi    Pune
3           4    Amit  Mumbai

Column-wise (add features)

In [9]:
pd.concat([customers, people], axis=1)

   CustomerID    Name    City   ID   Age
0           1  Piyush  Bhopal  1.0  26.0
1           2   Sneha   Delhi  2.0  25.0
2           3    Ravi    Pune  3.0  27.0
3           4    Amit  Mumbai  NaN   NaN

Mini Exercises

1. Merge customers and orders using:
   - inner join
   - left join
   - outer join

2. Which customer has spent the highest total Amount? (Group + Merge)

3. Add a discount column to orders and recompute net amount.

4. Concatenate two random slices of customers and restore index.

In [16]:
total_spent = orders.groupby('CustomerID')['Amount'].sum().reset_index()
total_spent.columns = ['CustomerID', 'total_spent']

In [18]:
result = pd.merge(customers, total_spent, on='CustomerID', how='inner')

In [19]:
top_customer = result.loc[result['total_spent'].idxmax()]
print(top_customer)

CustomerID          1
Name           Piyush
City           Bhopal
total_spent     17000
Name: 0, dtype: object

### ✅ Summary

- Merging allows combining tables based on a key (similar to SQL JOINs).
- Left / right / inner / outer joins let us control how unmatched data is treated.
- Concatenation stacks DataFrames either vertically (more rows) or horizontally (more columns).